stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_i3c.c
  return status;
}

/**
  * @brief  Get BCR, DCR and PID information after ENTDAA.
  * @param  hi3c     : [IN] Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                         for the specified I3C.
  * @param  ENTDAA_payload  :[IN] Payload received after ENTDAA
  * @param  pENTDAA_payload :[OUT] Pointer to an I3C_ENTDAAPayloadTypeDef structure that contains the BCR, DCR and PID
  *                          information.
  * @retval HAL Status : Value from HAL_StatusTypeDef enumeration.
  */
HAL_StatusTypeDef HAL_I3C_Get_ENTDAA_Payload_Info(I3C_HandleTypeDef *hi3c,
                                                  uint64_t ENTDAA_payload,
                                                  I3C_ENTDAAPayloadTypeDef *pENTDAA_payload)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t BCR;
  uint64_t PID;

  /* check on the handle */
  if (hi3c == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check on user parameters */
    if (pENTDAA_payload == NULL)
    {
      /* Update handle error code parameter */
      hi3c->ErrorCode = HAL_I3C_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
    else
    {
      /* Get Bus Characterics */
      BCR = __HAL_I3C_GET_BCR(ENTDAA_payload);

      /* Retrieve BCR information */
      pENTDAA_payload->BCR.IBIPayload = __HAL_I3C_GET_IBI_PAYLOAD(BCR);
      pENTDAA_payload->BCR.IBIRequestCapable = __HAL_I3C_GET_IBI_CAPABLE(BCR);
      pENTDAA_payload->BCR.DeviceRole = __HAL_I3C_GET_CR_CAPABLE(BCR);
      pENTDAA_payload->BCR.AdvancedCapabilities = I3C_GET_ADVANCED_CAPABLE(BCR);
      pENTDAA_payload->BCR.OfflineCapable = I3C_GET_OFFLINE_CAPABLE(BCR);
      pENTDAA_payload->BCR.VirtualTargetSupport = I3C_GET_VIRTUAL_TGT(BCR);
      pENTDAA_payload->BCR.MaxDataSpeedLimitation = I3C_GET_MAX_DATA_SPEED_LIMIT(BCR);

      /* Get Device Characterics */
      pENTDAA_payload->DCR = I3C_GET_DCR(ENTDAA_payload);

      /* Get Provisioned ID */
      PID = I3C_GET_PID(ENTDAA_payload);

      /* Change PID from BigEndian to litlleEndian */
      PID = (uint64_t)((((uint64_t)I3C_BIG_TO_LITTLE_ENDIAN((uint32_t) PID) << 32)   |
                        ((uint64_t)I3C_BIG_TO_LITTLE_ENDIAN((uint32_t)(PID >> 32)))) >> 16);

      /* Retrieve PID information*/
      pENTDAA_payload->PID.MIPIMID = I3C_GET_MIPIMID(PID);
      pENTDAA_payload->PID.IDTSEL = I3C_GET_IDTSEL(PID);
      pENTDAA_payload->PID.PartID = I3C_GET_PART_ID(PID);
      pENTDAA_payload->PID.MIPIID = I3C_GET_MIPIID(PID);
    }
  }

  return status;
}

/**
  * @}
  */

/** @defgroup I3C_Exported_Functions_Group8 Autonomous Mode Functions
  * @brief    Autonomous Mode Functions
  *
@verbatim
 =======================================================================================================================
                                       ##### Autonomous Mode functions #####
 =======================================================================================================================
    [..]  This subsection provides a set of functions allowing to configure the Autonomous Trigger Mode and to configure
          the automatic HW clear of the FC flag at the end of a Frame of the peripheral.

         (+) Call the function HAL_I3C_SetConfigAutonomousMode() to set Autonomous Mode configuration.
         (+) Call the function HAL_I3C_GetConfigAutonomousMode() to get Autonomous Mode configuration.
         (+) Call the function HAL_I3C_ClearConfigAutonomousMode() to clear Autonomous Mode configuration.
         (+) Call the function HAL_I3C_SetConfigEndOfFrame() to set the configuration for the automatic treatment of
             the FC flag at the end of a Frame.
         (+) Call the function HAL_I3C_GetConfigEndOfFrame() to get the configuration for the automatic treatment of
             the FC flag at the end of a Frame.
@endverbatim
  * @{
  */

/**
  * @brief  Set Autonomous Mode configuration
  * @param  hi3c     : [IN] Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                         for the specified I3C.
  * @param  sConfig  : [IN] Pointer to an I3C_AutonomousModeConfTypeDef structure that contains
  *                         the configuration information of the autonomous mode for the specified I3C peripheral.
  * @retval HAL Status  : Value from HAL_StatusTypeDef enumeration.
  */
HAL_StatusTypeDef HAL_I3C_SetConfigAutonomousMode(I3C_HandleTypeDef *hi3c,
                                                  const I3C_AutonomousModeConfTypeDef *sConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* check on the handle */
  if (hi3c == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* check on the Mode */
    if (hi3c->Mode != HAL_I3C_MODE_CONTROLLER)
    {
      hi3c->ErrorCode = HAL_I3C_ERROR_NOT_ALLOWED;
      status = HAL_ERROR;
    }
    /* Check on user parameters */
    else if (sConfig == NULL)
    {
      /* Update handle error code parameter */
      hi3c->ErrorCode = HAL_I3C_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
    else if (hi3c->State != HAL_I3C_STATE_READY)
    {
      status = HAL_BUSY;
    }
    else
    {
      hi3c->State = HAL_I3C_STATE_BUSY;

      /* Check the parameters */
      assert_param(IS_I3C_TRIG_INPUT_INSTANCE(hi3c->Instance));
      assert_param(IS_I3C_TRIG_SOURCE(hi3c->Instance, sConfig->TriggerSelection));
      assert_param(IS_I3C_AUTO_MODE_TRG_POL(sConfig->TriggerPolarity));

      /* Disable the selected I3C peripheral to be able to configure CFGR */
      LL_I3C_Disable(hi3c->Instance);

      /* I3Cx CFGR Configuration */
      MODIFY_REG(hi3c->Instance->CFGR,
                 (I3C_CFGR_TRIGHWEN_Msk | I3C_CFGR_TRIGSEL_Msk | I3C_CFGR_TRIGPOL_Msk),
                 (sConfig->TriggerState | \
                  (sConfig->TriggerSelection & I3C_CFGR_TRIGSEL_Msk) | \
                  sConfig->TriggerPolarity));

      /* Enable the selected I3C peripheral */
      LL_I3C_Enable(hi3c->Instance);

      hi3c->State = HAL_I3C_STATE_READY;
    }
  }

