stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_i3c.c
  return status;
}

/**
  * @brief  Get Autonomous Mode configuration
  * @param  hi3c     : [IN] Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                         for the specified I3C.
  * @param  sConfig  : [OUT] Pointer to an I3C_AutonomousModeConfTypeDef structure that contains
  *                          the configuration information of the autonomous mode for the specified I3C peripheral.
  * @retval HAL Status  : Value from HAL_StatusTypeDef enumeration.
  */
HAL_StatusTypeDef HAL_I3C_GetConfigAutonomousMode(const I3C_HandleTypeDef *hi3c,
                                                  I3C_AutonomousModeConfTypeDef *sConfig)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t cfgr_tmp;

  /* check on the handle */
  if (hi3c == NULL)
  {
    status = HAL_ERROR;
  }
  /* Check on user parameters */
  else if (sConfig == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check the parameters */
    assert_param(IS_I3C_TRIG_INPUT_INSTANCE(hi3c->Instance));

    cfgr_tmp = hi3c->Instance->CFGR;

    sConfig->TriggerState     = (cfgr_tmp & I3C_CFGR_TRIGHWEN);

    sConfig->TriggerSelection = ((cfgr_tmp & I3C_CFGR_TRIGSEL) | I3C_TRIG_GRP1);

    sConfig->TriggerPolarity  = (cfgr_tmp & I3C_CFGR_TRIGPOL);
  }

  return status;
}

/**
  * @brief  Clear Autonomous Mode configuration
  * @param  hi3c     : [IN] Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                         for the specified I3C.
  * @retval HAL Status  : Value from HAL_StatusTypeDef enumeration.
  */
HAL_StatusTypeDef HAL_I3C_ClearConfigAutonomousMode(I3C_HandleTypeDef *hi3c)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* check on the handle */
  if (hi3c == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* check on the Mode */
    if (hi3c->Mode != HAL_I3C_MODE_CONTROLLER)
    {
      hi3c->ErrorCode = HAL_I3C_ERROR_NOT_ALLOWED;
      status = HAL_ERROR;
    }
    else if (hi3c->State != HAL_I3C_STATE_READY)
    {
      status = HAL_BUSY;
    }
    else
    {
      hi3c->State = HAL_I3C_STATE_BUSY;

      /* Check the parameters */
      assert_param(IS_I3C_TRIG_INPUT_INSTANCE(hi3c->Instance));

      /* Disable the selected I3C peripheral to be able to clear Trigger value in CFGR */
      LL_I3C_Disable(hi3c->Instance);

      /* I3Cx CFGR Configuration */
      MODIFY_REG(hi3c->Instance->CFGR,
                 (I3C_CFGR_TRIGHWEN_Msk | I3C_CFGR_TRIGSEL_Msk | I3C_CFGR_TRIGPOL_Msk),
                 (I3C_TRIGGER_DISABLE | I3C_TRIG_POLARITY_LOW));

      /* Enable the selected I3C peripheral */
      LL_I3C_Enable(hi3c->Instance);

      hi3c->State = HAL_I3C_STATE_READY;
    }
  }

  return status;
}

/**
  * @brief  Set the configuration for automatic treatment of the FC flag at the end of a Frame.
  * @note   The controller operational HAL functions not allowed, when the configuration of the automatic treatment
  *         of the FC flag at the end of a Frame, set to @ref I3C_END_OF_FRAME_CPLT_DISABLE.
  * @param  hi3c         : [IN] Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                             for the specified I3C.
  * @param  EOFrameMode  : [IN] Specifies the rule for automatic treatment for the end of a Frame.
  *                             It can be a value of @ref I3C_EndOfFrameConfig.
  *
  * @retval HAL Status : Value from HAL_StatusTypeDef enumeration.
  */
HAL_StatusTypeDef HAL_I3C_SetConfigEndOfFrame(I3C_HandleTypeDef *hi3c, uint32_t EOFrameMode)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* check on the handle */
  if (hi3c == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* check on the Mode */
    if (hi3c->Mode != HAL_I3C_MODE_CONTROLLER)
    {
      hi3c->ErrorCode = HAL_I3C_ERROR_NOT_ALLOWED;
      status = HAL_ERROR;
    }
    else if (hi3c->State != HAL_I3C_STATE_READY)
    {
      status = HAL_BUSY;
    }
    else
    {
      hi3c->State = HAL_I3C_STATE_BUSY;

      /* Check the parameters */
      assert_param(IS_I3C_END_OF_FRAME_MODE(EOFrameMode));

      /* Disable the selected I3C peripheral to be able to configure CFGR */
      LL_I3C_Disable(hi3c->Instance);

      /* I3Cx CFGR Configuration */
      MODIFY_REG(hi3c->Instance->CFGR, I3C_CFGR_FCFDIS_Msk, EOFrameMode);

      /* Enable the selected I3C peripheral */
      LL_I3C_Enable(hi3c->Instance);

      hi3c->State = HAL_I3C_STATE_READY;
    }
  }

  return status;
}

/**
  * @brief  Get the configuration for automatic treatment of the FC flag at the end of a Frame.
  * @param  hi3c         : [IN] Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                             for the specified I3C.
  * @param  pEOFrameMode : [OUT] Pointer to the returned configuration of the rule for automatic treatment for the
  *                              the end of a Frame. It can be a value of @ref I3C_EndOfFrameConfig.
  * @retval HAL Status : Value from HAL_StatusTypeDef enumeration.
  */
HAL_StatusTypeDef HAL_I3C_GetConfigEndOfFrame(const I3C_HandleTypeDef *hi3c, uint32_t *pEOFrameMode)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* check on the handle */
  if (hi3c == NULL)
  {
    status = HAL_ERROR;
  }
  /* Check on user parameters */
  else if (pEOFrameMode == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check the parameters */
    assert_param(IS_I3C_TRIG_INPUT_INSTANCE(hi3c->Instance));

    /* Check End of Frame mode */
    if (LL_I3C_GetEndOfFrameMode(hi3c->Instance) == LL_I3C_END_OF_FRAME_CPLT_DISABLE)
    {
      *pEOFrameMode     = I3C_END_OF_FRAME_CPLT_DISABLE;
    }
    else
    {
      *pEOFrameMode     = I3C_END_OF_FRAME_CPLT_ENABLE;
    }
  }

  return status;
}
/**
  * @}
  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup I3C_Private_Functions I3C Private Functions
  * @{
  */

/**
  * @brief  Interrupt Sub-Routine which handles target received events.
  * @param  hi3c       : [IN]  Pointer to an I3C_HandleTypeDef structure that contains the configuration information
  *                            for the specified I3C.
  * @param  itMasks    : [IN]  Flag Interrupt Masks flags to handle.
  * @retval HAL Status :       Value from HAL_StatusTypeDef enumeration.
  */
static HAL_StatusTypeDef I3C_Tgt_Event_ISR(struct __I3C_HandleTypeDef *hi3c, uint32_t itMasks)
{
  uint32_t tmpevent = 0U;

  /* I3C Rx FIFO not empty interrupt Check */
  if (I3C_CHECK_FLAG(itMasks, HAL_I3C_IT_MASKS_RXFNEMIS) != RESET)
  {
    /* Call receive treatment function */
    hi3c->ptrRxFunc(hi3c);
  }

  /* I3C target complete controller-role hand-off procedure (direct GETACCR CCC) event management --------------------*/
  if (I3C_CHECK_FLAG(itMasks, HAL_I3C_IT_MASKS_CRUPDMIS) != RESET)
  {
    /* Clear controller-role update flag */
    LL_I3C_ClearFlag_CRUPD(hi3c->Instance);

    /* Set Identifier EVENT_ID_GETACCCR */
    tmpevent |= EVENT_ID_GETACCCR;
  }

